{"data":{"dataJson":{"projects":[{"title":"Luck","role":"CEO, Full Stack Developer","description":"The application to help to match each other in the group of friends to exchange gifts on St. Nicholas’ Day. Developed project from every side: frontend, backend, architecture, CI, deploy. After that, responsibility for marketing and consulting in the design process. The project was started to broaden horizons so it’s a reason why I have decided not to use popular frameworks to generate API or any ready deployment solutions.","webistes":[{"url":"https://luck.org.pl","icon":"icon-earth"},{"url":"https://facebook.com/app.luck","icon":"icon-facebook2"},{"url":"https://github.com/luck-js","icon":"icon-github"}],"subprojects":[{"title":"API","description":"API built with Node.js, Express, MongoDB that follows DDD + Clean Architecture principles. I assumed to create a model from writing unit tests.","webistes":[{"url":"https://github.com/luck-js/luck-api","icon":"icon-github"}]},{"title":"React UI","description":"Second version a UI written already with the use of Next.js with Typescript. The new version in addition to the new UI provided has been expanded to include a blog. Movement from SPA to server-side rendering helps website SEO.","webistes":[{"url":"https://github.com/luck-js/luck-ui-landing-page","icon":"icon-github"}]},{"title":"Angular UI","description":"First version UI wrote in the technology I know - Angular. Fastly UI developed was helps me to focus on understand tools and methodologies in the backend-side and deploy.","webistes":[{"url":"https://github.com/luck-js/luck-ui","icon":"icon-github"}]},{"title":"Strapi CMS","description":"In the last time, a new area was discovered by me in the Javascript environment - CMS. I provided for the blog in the Luck content management system to easier manage and create content. I used the headless strapi library for this.","webistes":[{"url":"https://github.com/luck-js/luck-cms","icon":"icon-github"}]}]},{"title":"Pokédex","role":"Front Developer","description":"The recruitment task realized in Angular technology. In addition to technical skills, you can see the thought-out user interface and the was proposed unique design for a particular domain.","webistes":[{"url":"https://dkarski.github.io/poke-ui","icon":"icon-earth"},{"url":"https://github.com/dkarski/poke-ui","icon":"icon-github"}],"subprojects":[]},{"title":"Github Search","role":"Front Developer","description":"Recruitment Task. Like in the previous project this one was realized in Angular technology. UI and its functionalities were proposed by me.","webistes":[{"url":"https://dkarski.github.io/github-search","icon":"icon-earth"},{"url":"https://github.com/dkarski/github-search","icon":"icon-github"}],"subprojects":[]}]}}}